// Lab6_a.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include "windows.h"
using namespace std;

int main()
{
    srand(time(0));
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    int number = rand() % 100;
    int attempt;
    int tries = 0;

    printf("Введите число от 0 до 100:\n");

    while (true)
    {
        tries += 1;
        scanf_s("%d", &attempt);
         if (attempt < 0 || attempt > 100)
        {
        printf("Введенное число выходит за границы условия\n");
        }
        if (attempt < number && attempt <= 100)
        {
            printf("Введите число больше:\n");
        }
        else if
            (attempt > number || attempt > 0 && attempt >= 100)
        {
            printf("Введите число меньше:\n");
        }

        else if (attempt == number)
        {
            printf("\n\nВы угадали число!\n");
            printf("Попыток использовано: %d\n", tries);
        }
    }


    return 0;
}


// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
