// Lab1_6.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;
int main()
{
    /*const int sec_in_min = 60;
    int sec_in_hour = 60 * sec_in_min;
    int sec_in_day = 24 * sec_in_hour;
    long long sec_in_year = 365*sec_in_day;
    long long sec_in_100_years = 100 * sec_in_year;
    long long sec_in_1000_years = 1000 *sec_in_year*/
    const int sec_in_min = 60;
    int sec_in_hour = 60 * sec_in_min;
    int sec_in_day = 24 * sec_in_hour;
    long long sec_in_year = 365 * sec_in_day;
    int years;
    years = 1000;
    long long total = years * sec_in_year;

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
